mriise/lpc55-pac/svd/pack-13.1.0-LPC55S28.xml
<?xml version="1.0" encoding="UTF-8"?>
<device schemaVersion="1.3" xmlns:xs="http://www.w3.org/2001/XMLSchema-instance" xs:noNamespaceSchemaLocation="CMSIS-SVD.xsd">
  <vendor>nxp.com</vendor>
  <name>LPC55S28</name>
  <version>1.0</version>
  <description>LPC55S28JBD100,LPC55S28JBD64,LPC55S28JEV98</description>
  <licenseText>
Copyright 2016-2021 NXP
All rights reserved.

SPDX-License-Identifier: BSD-3-Clause
  </licenseText>
  <cpu>
    <name>CM33</name>
    <revision>r2p0</revision>
    <endian>little</endian>
    <mpuPresent>true</mpuPresent>
    <fpuPresent>true</fpuPresent>
    <vtorPresent>true</vtorPresent>
    <nvicPrioBits>3</nvicPrioBits>
    <vendorSystickConfig>false</vendorSystickConfig>
  </cpu>
  <addressUnitBits>8</addressUnitBits>
  <width>32</width>
  <peripherals>
    <peripheral>
      <name>FLASH_CFPA0</name>
      <description>FLASH_CFPA</description>
      <groupName>FLASH_CFPA</groupName>
      <headerStructName>FLASH_CFPA</headerStructName>
      <baseAddress>0x9E000</baseAddress>
      <addressBlock>
        <offset>0</offset>
        <size>0x200</size>
        <usage>registers</usage>
      </addressBlock>
      <registers>
        <register>
          <name>HEADER</name>
          <description>.</description>
          <addressOffset>0</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>FIELD</name>
              <description>.</description>
              <bitOffset>0</bitOffset>
              <bitWidth>32</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>VERSION</name>
          <description>.</description>
          <addressOffset>0x4</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>FIELD</name>
              <description>.</description>
              <bitOffset>0</bitOffset>
              <bitWidth>32</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>S_FW_Version</name>
          <description>Secure firmware version (Monotonic counter)</description>
          <addressOffset>0x8</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>FIELD</name>
              <description>.</description>
              <bitOffset>0</bitOffset>
              <bitWidth>32</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>NS_FW_Version</name>
          <description>Non-Secure firmware version (Monotonic counter)</description>
          <addressOffset>0xC</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>FIELD</name>
              <description>.</description>
              <bitOffset>0</bitOffset>
              <bitWidth>32</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>IMAGE_KEY_REVOKE</name>
          <description>Image key revocation ID (Monotonic counter)</description>
          <addressOffset>0x10</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>FIELD</name>
              <description>.</description>
              <bitOffset>0</bitOffset>
              <bitWidth>32</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>ROTKH_REVOKE</name>
          <description>.</description>
          <addressOffset>0x18</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>RoTK0_EN</name>
              <description>RoT Key 0 enable. 00 - Invalid 01 - Enabled 10, 11 - Key revoked</description>
              <bitOffset>0</bitOffset>
              <bitWidth>2</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>RoTK1_EN</name>
              <description>RoT Key 1 enable. 00 - Invalid 01 - Enabled 10, 11 - Key revoked</description>
              <bitOffset>2</bitOffset>
              <bitWidth>2</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>RoTK2_EN</name>
              <description>RoT Key 2 enable. 00 - Invalid 01 - Enabled 10, 11 - Key revoked</description>
              <bitOffset>4</bitOffset>
              <bitWidth>2</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>RoTK3_EN</name>
              <description>RoT Key 3 enable. 00 - Invalid 01 - Enabled 10, 11 - Key revoked</description>
              <bitOffset>6</bitOffset>
              <bitWidth>2</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>VENDOR_USAGE</name>
          <description>.</description>
          <addressOffset>0x1C</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>DBG_VENDOR_USAGE</name>
              <description>DBG_VENDOR_USAGE.</description>
              <bitOffset>0</bitOffset>
              <bitWidth>16</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>INVERSE_VALUE</name>
              <description>inverse value of bits [15:0]</description>
              <bitOffset>16</bitOffset>
              <bitWidth>16</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>DCFG_CC_SOCU_PIN</name>
          <description>With TZ-M, the part can be sold by level 1 customers (secure code developer) to level-2 customers who develops non-secure code only. - In this scenario, or easy of development, Level-I customer releases the part to always allow non-secure debug. - To allow level-2 customers to further seal the part DCFG_CC_SOCU_NS is used. - ROM will use this word to further restrict the debug access.</description>
          <addressOffset>0x20</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>NIDEN</name>
              <description>Non Secure non-invasive debug enable</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>VALUE_0</name>
                  <description>Use DAP to enable</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>VALUE_1</name>
                  <description>Fixed state</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>DBGEN</name>
              <description>Non Secure debug enable</description>
              <bitOffset>1</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>VALUE_0</name>
                  <description>Use DAP to enable</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>VALUE_1</name>
                  <description>Fixed state</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>SPNIDEN</name>
              <description>Secure non-invasive debug enable</description>
              <bitOffset>2</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>VALUE_0</name>
                  <description>Use DAP to enable</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>VALUE_1</name>
                  <description>Fixed state</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>SPIDEN</name>
              <description>Secure invasive debug enable</description>
              <bitOffset>3</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>VALUE_0</name>
                  <description>Use DAP to enable</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>VALUE_1</name>
                  <description>Fixed state</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>TAPEN</name>
              <description>JTAG TAP enable</description>
              <bitOffset>4</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>VALUE_0</name>
                  <description>Use DAP to enable</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>VALUE_1</name>
                  <description>Fixed state</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>CPU1_DBGEN</name>
              <description>CPU1 (Micro cortex M33) invasive debug enable</description>
              <bitOffset>5</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>VALUE_0</name>
                  <description>Use DAP to enable</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>VALUE_1</name>
                  <description>Fixed state</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>ISP_CMD_EN</name>
              <description>ISP Boot Command enable</description>
              <bitOffset>6</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>VALUE_0</name>
                  <description>Use DAP to enable</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>VALUE_1</name>
                  <description>Fixed state</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>FA_CMD_EN</name>
              <description>FA Command enable</description>
              <bitOffset>7</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>VALUE_0</name>
                  <description>Use DAP to enable</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>VALUE_1</name>
                  <description>Fixed state</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>ME_CMD_EN</name>
              <description>Flash Mass Erase Command enable</description>
              <bitOffset>8</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>VALUE_0</name>
                  <description>Use DAP to enable</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>VALUE_1</name>
                  <description>Fixed state</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>CPU1_NIDEN</name>
              <description>CPU1 (Micro cortex M33) non-invasive debug enable</description>
              <bitOffset>9</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>VALUE_0</name>
                  <description>Use DAP to enable</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>VALUE_1</name>
                  <description>Fixed state</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>UUID_CHECK</name>
              <description>Enforce UUID match during Debug authentication.</description>
              <bitOffset>15</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>INVERSE_VALUE</name>
              <description>inverse value of bits [15:0]</description>
              <bitOffset>16</bitOffset>
              <bitWidth>16</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
